# 목차
1. 주피터 노트북 일반
  - 편집모드 및 실행
  - 마크다운 문법
2. 기초 문법
  - 변수/변수형
  - collection 객체 다루기
  - 조건문과 반복문
  - 함수
3. 데이터 핸들링(pandas 기반)
  - csv 불러오기 / 출력
  - 데이터 합치기(merge, concat)
  - 데이터 재형성(stack, unstack)
4. 패키지 불러오기

# 1. 주피터 노트북 일반
## jupyter notebook 설명서(영문)
https://jupyter-notebook.readthedocs.io/

## 편집모드 및 실행
- 셀의 코드부분을 선택하거나 enter를 눌러 편집모드(오른쪽 위에 펜 표시, 선택된 셀의 초록색 사각형 테두리로 확인)로 들어가면 편집이 가능
- esc를 누르면 편집모드에서 나와서 커맨드모드(오른쪽 위에 펜 표시가 없어짐, 선택된 셀의 파란색 테두리로 확인)로 들어갈 수 있음. 커맨드 모드에서는 키보드의 버튼이 셀의 추가/삭제 등의 단축키와 연결되므로, **이 상태에서 코드를 입력하려고 하면 예상하지 못한 결과가 발생할 수 있으니 주의**
- 어느 모드이건 위의 Run 버튼 등을 이용해서 셀 단위로 실행 가능. 마크다운이라면 조판되고, 코드라면 실행 후 출력된 결과 들이 셀 밑에 생성됨

## 마크다운 문법 <a name="mdsyntax_head"></a>
- 마크다운 셀은 python 코드가 아니라 markdown 마크업 언어로 설명글 등을 작성하는 용도로 사용
- 여기서는 자주 사용되는 마크다운 문법들을 참고용으로 작성함. 
  조판된 마크다운 셀은 편집모드로 다시 들어가면 markdown으로 어떻게 작성했는지 확인 가능
- 조판했을때 markdown 문법 적용 안하고 그대로 표기 하기 : backtick(\`) 로 감싼 부분

### 제목(headings)
- 행 맨 앞의 샵('#') 기호로 제목 부분임을 표기
- 기호 수로 수준을 정함

예제
# 1수준
## 2수준
### 3수준
#### 4수준
##### 5수준
###### 6수준

### 강조(굵은 문자)
- 아스테리스크 2개나 밑줄 2개로 감싼 부분은 강조됨

예제

**아스테리스크 강조**

__밑줄 강조__

### 리스트
- 행 맨앞의 하이픈으로 숫자 없는 항목형 리스트 구성
- 행 맨앞의 (숫자).표기로 숫자 리스트 구성
- 들여쓰기로 수준 구분 가능

예제
- 도입부
  1. 내용 1
  2. 내용 2
- 본론
  1. 내용 3
  2. 내용 4
- 결론

### 링크
- `[링크로 표시되는 글](URL)`의 형태로 작성. URL 부분을 생략하면 링크로 표시되는 글 부분이 URL로 사용됨
- html 에서처럼 링크를 걸고 싶은 마크다운 부분에 `<a name="(적당한 위치 명칭)"></a>`로 앵커를 추가한 뒤 URL 부분에 `#(위치 명칭)`을 사용하면 링크가 해당 앵커 위치를 가리키게됨

예제
- [github 링크 : 파이썬 기초 강좌](https://github.com/jsh-begas/python_basic_lecture)
- [<https://github.com/jsh-begas/python_basic_lecture>]
- [마크다운 문법 처음으로 돌아가기](#mdsyntax_head)

### 이미지
- `![그림 안들어가면 대신 표시할 문자](이미지 주소/URL)`의 형태로 작성
- 그림을 온라인에 올리고 싶은데 적당히 업로드 할 곳이 없다면 github 사용 가능
- 로컬 이미지 주소는 절대주소/이 ipynb 노트북 파일(혹은 조판 시점의 Python 커널의 작업 디렉토리)에 대한 상대 주소로 설정

예제
- (아랫줄의 markdown 표기 : `![python logo](https://www.python.org/static/community_logos/python-logo.png)`)
  ![python logo](https://www.python.org/static/community_logos/python-logo.png)
- (아랫줄의 markdown 표기 : `![없는 그림](idk.png)`
  ![없는 그림](idk.png)

### 코드 블럭
- backtick 3개로 감싼 부분은 코드처럼 구분해서 보여줌

예제
```
  print('hello world!')
```

### 기타
- 표
| 1열 | 2열 | 3열 |
|----|----|----|
|A | B | C |
- 구분선 : ---
---
- 인용 블럭 : 행 처음의 `>`. 인용블럭 안쪽에서 블럭 안나누고 행 바꾸기는 스페이스 2개 + 줄바꿈으로 구현
> 인용하기.  
> 인용하기 두번째줄.
인용하기 이어짐.

인용블럭 바깥쪽.

# 2. Python 기초 문법 <a href="ch2"></a>

## 변수

In [1]:
# 코드 셀에서 각 행의 샵 뒤의 부분은 주석으로 취급되며 실행되지 않음
# 변수 할당
x = 2

In [2]:
# 각 셀을 실행한 환경은 (jupyter notebook 본체가 닫히는 등의 이유로) Python 커널이 종료되지 않는 한 유지됨
# 곧, 앞 셀을 실행한 직후라면 x 변수에 값 2 가 저장된 환경이 유지됨
# 변수 값 출력 (일반적으로 셀을 실행하면 각 셀의 마지막 행의 실행 결과가 항상 out 부분에 저장됨)
x

2

In [3]:
# print()로 셀 마지막 행의 출력이 아닌 결과도 보기
x = 3
print(x)
x

3

3

In [4]:
# 안되는 변수명들
5ri = 5
and = 4
my home = 2

SyntaxError: invalid decimal literal (1976213465.py, line 2)

## 변수 유형 - 단일

In [5]:
# type 보기 : 함수 type()
print(type(3))
print(type(3.0))

<class 'int'>
<class 'float'>

In [6]:
# type별 혹은 객체의 메서드 보기 : dir()
print(dir(int))
#데이터 유형 및 객체의 메서드는 객체.메서드명의 형태로 표현
# 함수/메서드 도움말 보기 : (함수/메서드)?
#list.append?

['__abs__', '__add__', '__and__', '__bool__', '__ceil__', '__class__', '__delattr__', '__dir__', '__divmod__', '__doc__', '__eq__', '__float__', '__floor__', '__floordiv__', '__format__', '__ge__', '__getattribute__', '__getnewargs__', '__gt__', '__hash__', '__index__', '__init__', '__init_subclass__', '__int__', '__invert__', '__le__', '__lshift__', '__lt__', '__mod__', '__mul__', '__ne__', '__neg__', '__new__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rlshift__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rrshift__', '__rshift__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__trunc__', '__xor__', 'as_integer_ratio', 'bit_count', 'bit_length', 'conjugate', 'denominator', 'from_bytes', 'imag', 'numerator', 'real', 'to_bytes']

In [7]:
# 정수
print(type(0))

<class 'int'>

In [8]:
# 부동소수점(소수)
print(type(0.1))

<class 'float'>

In [9]:
# 복소수
print(type(1+1j))

<class 'complex'>

In [10]:
# 논리(참, 거짓)
print(type(True))
#x = TRUE #대소문자중 첫번째만 대문자인 형태로 적어야 인식됨

<class 'bool'>

In [11]:
# 문자열
print(type('abc'))
'''
abc
def
'''

<class 'str'>

'\nabc\ndef\n'

## 변수 유형 - 컬렉션(collection) 형

In [12]:
# 리스트
my_list = [1, 'a', True]
my_list2 = [4, my_list]
print(my_list2)

[4, [1, 'a', True]]

In [13]:
# 튜플
my_tuple = (1, 'a', True)
print(type((1))) #이 경우 (1)은 튜플이 아니라 정수를 가리키게 됨
print(type((1,)))

<class 'int'>
<class 'tuple'>

In [14]:
# 집합(Set)
my_set = {2,3,5}
print(type(my_set))

<class 'set'>

In [15]:
# 딕셔너리
my_dict = {'first':1, 'second':'a'}
print(type(my_dict))

<class 'dict'>

### 컬렉션형 다뤄보기
#### 리스트

In [16]:
#리스트 생성
a = [1,2,3,4]
a

[1, 2, 3, 4]

In [17]:
#부분 편집
a[0] = 100 #항 값 변경. python의 index는 0부터 시작하며, 첫번째 항을 100으로 할당하라는 명령이 됨
print(a)
a.append(8) #맨 끝의 새 칸에 8 추가 
print(a)
a.remove(100) #일치하는 값 중 맨 앞의 것을 하나를 칸 째로 제거
print(a)
a.insert(1, 100) #index 1 (앞에서부터 두번째)에 값 100인 칸 하나를 추가, 뒤쪽칸은 하나씩 밀어냄
print(a)

[100, 2, 3, 4]
[100, 2, 3, 4, 8]
[2, 3, 4, 8]
[2, 100, 3, 4, 8]

In [18]:
#슬라이싱
a=[4,6,1,9]
print(a[1:3]) #index 1부터 3까지(항상 오른쪽 끝점은 제외), 1칸씩 선택
print(a[:3]) #index 0(기본값)부터 3까지, 1칸씩 선택
print(a[:-2]) #index 0부터 -2=3까지, 1칸씩 선택 (음의 index는 마지막 -1부터 -2, .... 오른쪽 끝이 -1이며 왼쪽으로 갈수록 감소.)
print(a[:]) #전체 선택
print(a[::2]) #index 2칸마다 선택

[6, 1]
[4, 6, 1]
[4, 6]
[4, 6, 1, 9]
[4, 1]

In [19]:
[1,3] + [2,4] #이어 붙이기
c = [1,3,5]
a + c

[4, 6, 1, 9, 1, 3, 5]

In [20]:
del a[0] #0번째 성분 제거
print(a)
del a[1:3] #index 1부터 3까지 제거
print(a)
del a #변수 제거
#print(a) #변수가 없어서 오류

[6, 1, 9]
[6]

#### 튜플

In [21]:
t = (1,3)
#t[2] = 3 #오류 발생

#### 집합(set)

In [22]:
set1 = {1,2,3,3} #정의할 때 중복되어도 되나, 집합 상에서는 중복값이 제거됨
set1

{1, 2, 3}

In [23]:
set2 = {3,4,5,6}

In [24]:
#집합 연산들
print(set1.intersection(set2)) #혹은 set1&set2, 교집합
print(set1.union(set2))  #혹은 set1|set2, 합집합
print(set1.difference(set2)) #혹은 set1-set2, 차집합
print(set1.symmetric_difference(set2)) #대칭차집합

{3}
{1, 2, 3, 4, 5, 6}
{1, 2}
{1, 2, 4, 5, 6}

#### 딕셔너리
- 각 성분은 key:value 구조로 구성

In [25]:
country_capital = {'영국':'런던','호주':'멜버른','덴마크':'코펜하겐'}
country_capital

{'영국': '런던', '호주': '멜버른', '덴마크': '코펜하겐'}

In [26]:
#부분 편집
country_capital['독일'] = '베를린' #기존 key의 value 변경/새 key-value 추가
print(country_capital)
del country_capital['독일'] #key-value 제거
print(country_capital)
#업데이트 : 다른 딕셔너리로부터 겹치는 key-value는 value를 업데이트, 안겹치는 key-value는 새로 추가
country_capital_add = {'한국':'서울','미국':'뉴욕', '독일':'berlin'}
country_capital.update(country_capital_add)
print(country_capital)
#비우기
country_capital.clear()
print(country_capital)

{'영국': '런던', '호주': '멜버른', '덴마크': '코펜하겐', '독일': '베를린'}
{'영국': '런던', '호주': '멜버른', '덴마크': '코펜하겐'}
{'영국': '런던', '호주': '멜버른', '덴마크': '코펜하겐', '한국': '서울', '미국': '뉴욕', '독일': 'berlin'}
{}

In [27]:
#부분 출력(key, value)
print(country_capital.keys()) #key만 
print(country_capital.values()) #value만
print(country_capital.items()) #쌍으로 (길이 2 튜플)
print(list(country_capital.keys())) #list()를 이용해서 리스트로 변환

dict_keys([])
dict_values([])
dict_items([])
[]


## 제어문

### 조건을 검사할 때 사용할 수 있는 연산자 : 비교연산자, 논리연산자

In [28]:
#비교연산자
a = 3
print(a == 4)
print(a != 4)
print(a <  4)
print(a >= 4)
#논리연산자
b = 4
print(a == 3 and b == 3) 
print(a == 3 or b == 3)
print(not a == 3)

False
True
True
False
False
True
False

### 조건문 (if ~ elif ~ else)
- 조건문/반복문의 선언 끝에는 콜론(:)을 붙임
- 조건문/반복문으로 분기되어 실행되는 하위 블럭은 들여쓰기로 구분

In [29]:
#단일 조건 분기 (if)
x = 10
if x > 90: #거짓임 -> 하위 블럭 전체 뛰어넘음
    print("90보다 크다")

In [30]:
x = 10
if x < 90: #참임 -> 하위 블럭 실행
    print("90보다 작다")

90보다 작다

In [31]:
#단일 조건 vs 그 외 조건으로 분기 (if ~ else)
x = 10
if x > 90: #거짓
    print("90보다 크다")
else : #위 조건이 전부 거짓이면 실행 
    print("90보다 작거나 같다")

90보다 작거나 같다

In [32]:
#여러 조건 분기 (if ~ elif (~ else))
x = 90
if x > 90:
    print("90보다 크다")
elif x < 90: #윗 조건문이 거짓이면 판정 시도해서 실행여부 결정
    print("90보다 작다")
else : #윗 조건문이 전부 거짓이면 실행
    print('해당 없음')

해당 없음

### 반복문 (for, while)
- for 문은 반복 변수를 지정한 컬랙션의 원소 목록에서 순서대로 변화시켜가면서 반복 실행
- while 문은 조건이 참인 한 반복 실행

In [33]:
#for 문
for x in ['x1','x2']:
    print(x)

x1
x2

In [34]:
#중첩 for 문
for x in ['x1','x2']:
    for y in ['y1','y2']:
        print(x, y)

x1 y1
x1 y2
x2 y1
x2 y2

In [35]:
#while 문
i = 0
sum = 0
while(sum < 20): #처음 이 행에 진입했을때 조건이 참이면 하위 블럭 실행
    i = i + 1
    sum = sum + i #하위 블럭의 실행이 끝나면 다시 while 판정 행으로 이동
#위 블럭은 sum이 20보다 작은 한 계속 실행됨
    
print(i)
print(sum)

6
21

#### 반복문 제어 키워드
- break가 실행되면 반복문 전체의 실행을 중단하고 하위 블럭의 종료시점 뒤로 이동
- continue가 실행되면 현재 반복 부분의 실행을 중단하고 다음 반복 실행 : while은 바로 판정행 이동, for는 현재 반복변수 값 실행을 멈추고 다음 반복변수 값에서 실행 시작

In [36]:
#break
i = 0

while(i < 5):
    i = i + 1
    if i == 3:
        break #i = 3일때 break가 실행
    print(i)

#break가 실행 되면 바로 여기로 이동 : i = 2까지만 print됨

1
2

In [37]:
#continue
i = 0

while(i < 5): #continue가 실행되면 바로 여기로 이동
    i = i + 1
    if i == 3:
        continue #i = 3일때 continue가 실행
    print(i) #i = 3일때만 이 행이 실행되지 못함

1
2
4
5

## 함수의 정의 및 호출
- 함수 선언시 구조는 
def 함수명(항1, 항2, ...):
    <함수 코드>
의 형태
- 함수 안의 코드를 실행할 때 사용한 각 변수의 값을 결정할 때, 항으로부터 우선적으로 값을 가져오고, 항으로 정의되지 않은 변수는 함수 범위 밖에서의 값을 참조 (항의 이름과 변수명은 가급적 섞어쓰지 않는 것이 코딩할 때 덜 햇갈림)

In [38]:
w = 3
x = 4
def my_function(x,y,z):
    return(x+y+z / w) 
#항에 없는 변수 w는 실행 당시 함수 코드 밖에서 정의되어 있는 값 w=3을 참조하며, 그 값이 바뀌면 계산에도 반영됨
#항에 있는 변수 x는 함수 코드 밖에 정의된 x=4를 무시하고 항으로 입력된 값으로 계산

In [39]:
#호출시 항의 이름을 명시하지 않으면, 정의할 때의 순서대로 값을 대응 시킴.
my_function(3,4,5) #my_function(x=3,y=4,z=5)와 동일

8.666666666666666

# 3. 데이터 핸들링(pandas 기반)
csv 파일들은 [<https://github.com/jsh-begas/python_basic_lecture>] 에서 받을수 있음

In [40]:
# 패키지 불러오기 : import문 
import pandas as pd
import numpy as np
import os

In [41]:
#csv 파일이 있는 위치를 가리키도록 설정
dat_path = '.'
os.chdir(dat_path)

## csv 자료 python에 불러오기

In [42]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [43]:
pd.read_table('ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [44]:
df.dtypes

a           int64
b           int64
c           int64
d           int64
message    object
dtype: object

In [45]:
pd.read_csv('ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [46]:
# 데이터 불러오기 함수의 컬럼명 관련 설정들
pd.read_csv('ex1.csv', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [47]:
pd.read_csv('ex1.csv', names=['c1','c2','c3','c4','m'])

  c1  c2  c3  c4        m
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [48]:
df = pd.read_csv('ex1.csv', index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [49]:
df.loc[['hello'],:]

         a  b  c  d
message
hello    1  2  3  4

## pandas dataframe csv 자료로 출력하기

In [50]:
data = pd.read_csv('ex2.csv')
data

  something   a   b     c   d  message
0       one   1   2   3.0   4      NaN
1       two   5   6   NaN   8    world
2     three   9  10  11.0  12      foo

In [51]:
data.to_csv('out.csv')
pd.read_csv('out.csv')

   Unnamed: 0 something   a   b     c   d  message
0           0       one   1   2   3.0   4      NaN
1           1       two   5   6   NaN   8    world
2           2     three   9  10  11.0  12      foo

In [52]:
import sys
data.to_csv(sys.stdout, na_rep='my_NULL')

,something, a, b, c, d, message
0,one,1,2,3.0,4,my_NULL
1,two,5,6,my_NULL,8,world
2,three,9,10,11.0,12,foo

## 데이터 병합하기 (merge)
merge는 일반적인 데이터 분석에서 이야기하는 join에 대응되는 개념으로, 
on 항으로 매칭용 컬럼을 지정한 뒤, 데이터를 매칭해서 나머지 컬럼을 채워넣는 방식

In [53]:
#pd.merge
df1 = pd.read_csv('ex3.csv')
df1

  key   column1
0   a         0
1   b         1
2   d         2

In [54]:
df2 = pd.read_csv('ex4.csv')
df2

  key  column2
0   b        0
1   b        1
2   a        2
3   c        3
4   a        4
5   a        5
6   b        6

In [55]:
pd.merge(df1, df2, on='key')

  key   column1  column2
0   a         0        2
1   a         0        4
2   a         0        5
3   b         1        0
4   b         1        1
5   b         1        6

In [56]:
pd.merge(df1, df2, how='left')

  key   column1  column2
0   a         0      2.0
1   a         0      4.0
2   a         0      5.0
3   b         1      0.0
4   b         1      1.0
5   b         1      6.0
6   d         2      NaN

In [57]:
pd.merge(df1, df2, how='right')

  key   column1  column2
0   b       1.0        0
1   b       1.0        1
2   a       0.0        2
3   c       NaN        3
4   a       0.0        4
5   a       0.0        5
6   b       1.0        6

In [58]:
pd.merge(df1, df2, how='outer')

  key   column1  column2
0   a       0.0      2.0
1   a       0.0      4.0
2   a       0.0      5.0
3   b       1.0      0.0
4   b       1.0      1.0
5   b       1.0      6.0
6   d       2.0      NaN
7   c       NaN      3.0

## 데이터 이어붙이기 (concat)
매칭의 개념을 무시하고 그대로 특정 축 방향으로 이어 붙임

In [59]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s1

a    0
b    1
dtype: int64

In [60]:
s2 = pd.Series([2, 3, 4], index=['c','d','e'])
s2

c    2
d    3
e    4
dtype: int64

In [61]:
s3 = pd.Series([5, 6], index=['f', 'g'])
s3

f    5
g    6
dtype: int64

In [62]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [63]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

## 데이터 재형성(stack/unstack)
- stack : 데이터의 여러 컬럼들을 행 방향의 하위 index로 바꾸어 전체 데이터가 위 아래로 길어지도록 쌓음(stack)
- unstack : 하위 index로 길게 쌓여있던 데이터를 하위 index 한 종류마다 서로 다른 이름의 컬럼이 되도록 옆으로 펼쳐좋음

In [64]:
data = pd.DataFrame(
  np.arange(6).reshape((2,3))
  ,index = ['Ohio','Colorado']
  ,columns = ['one','two','three']
)
data

          one  two  three
Ohio        0    1      2
Colorado    3    4      5

In [65]:
data_stacked = data.stack() #one, two, three 컬럼명을 하위 index로 이동시킴
data_stacked

Ohio      one      0
          two      1
          three    2
Colorado  one      3
          two      4
          three    5
dtype: int32

In [66]:
data_stacked

Ohio      one      0
          two      1
          three    2
Colorado  one      3
          two      4
          three    5
dtype: int32

In [67]:
data_stacked.unstack(0) #level 0 (첫번째) index인 Ohio Colorado index를 컬럼으로 펼침

       Ohio  Colorado
one       0         3
two       1         4
three     2         5

In [68]:
data_stacked.unstack(-1) #level -1 (마지막) index인 one two three index를 컬럼으로 펼침

          one  two  three
Ohio        0    1      2
Colorado    3    4      5

# 4. 패키지 불러오기
- 설치는 anaconda prompt에 들어가서 pip이나 conda를 이용
- 불러올 때에는 import 문 이용

In [69]:
#불러오기 예제
import numpy
numpy.concatenate

In [70]:
import pandas as pd #축약형 사용
pd.concat

<function pandas.core.reshape.concat.concat(objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]', *, axis: 'Axis' = 0, join: 'str' = 'outer', ignore_index: 'bool' = False, keys=None, levels=None, names=None, verify_integrity: 'bool' = False, sort: 'bool' = False, copy: 'bool' = True) -> 'DataFrame | Series'>

In [73]:
from scipy import signal #본 패키지명을 쓰지 않고 참조하기
signal.stft #풀 이름인 scipy.signal.stft 대신

In [74]:
import matplotlib.pyplot as plt #서브패키지 불러와서 축약형